[
  [
    {
      "jobTitle": "Supervisor - Maintenance",
      "companyDetail": "SUPERVISOR- MAINTENANCE  \n ",
      "responsibilities": [
        "Provide Maintenance employees with guidance, direction and supervision in support of departmental operations. ",
        "Promptly address performance issues. ",
        "Actively promote all company policies and expectations, especially in support of safety plans and results. ",
        "Execute planned and scheduled maintenance operations within assigned area of responsibility. ",
        "Maintain a positive work environment by regularly communicating with employees on the shop floor and responding to employee issues and concerns in a timely manner. ",
        "Maintain well-organized and productive work areas. ",
        "Work with others to achieve department and company goals and objectives.",
        "Perform all other duties and special projects as assigned."
      ],
      "aboutUs": "About Us\n\n\n\nCarpenter Technology Corporation (NYSE: CRS) is a recognized leader in high-performance specialty alloy-based materials and process solutions for critical applications in the aerospace, defense, transportation, energy, industrial, medical, and consumer electronics markets. Founded in 1889, Carpenter has evolved to become a pioneer in premium specialty alloys, including titanium, nickel, and cobalt, as well as alloys specifically engineered for additive manufacturing (AM) processes and soft magnetics applications. Carpenter recently expanded its AM capabilities to provide a complete “powder-to-part” solution to accelerate materials innovation, offer rapid prototyping, and streamline parts production.\n\nCarpenter Technology Corporation offers a competitive salary and a comprehensive benefits package including life, medical, dental, vision, flexible spending accounts, disability coverage, 401k with company contributions as well as many other options to employees. Learn more\n\nCarpenter Technology Corporation is committed to ensuring that its online application process provides an equal employment opportunity to all job seekers, including individuals with disabilities.  If you believe you need a reasonable accommodation in order to search for a job opening or to submit an application, please contact us by emailing employment@cartech.com.   We will work to assist disabled job seekers whose disability prevents them from being able to apply online.  Only messages sent for this purpose will be considered.  A response to your request may take up to 5 business days."
    }
  ],
  [
    {
      "jobTitle": "Process Engineer - Forge & Press",
      "companyDetail": "Carpenter Technology Corporation is a leading producer and distributor of premium specialty alloys, including titanium alloys, nickel and cobalt based superalloys, stainless steels, alloy steels and tool steels.  Carpenter’s high-performance materials and advanced process solutions are an integral part of critical applications used within the aerospace, transportation, medical and energy markets, among other markets.  Building on its history of innovation, Carpenter’s powder technology capabilities support a range of next-generation products and manufacturing techniques, including additive manufacturing and 3D printing.",
      "responsibilities": [
        "Manage the upgrade, rebuild, installation and start-up of process equipment. ",
        "Provides leadership in the development of new equipment specifications. ",
        "Analyze key process measures and determine major issues and their root causes. ",
        "Identify equipment safety issues and implement solutions. ",
        "Provide technical assistance and an interface function on process, product, and maintenance problems. ",
        "Manage outside resources including contractors, equipment vendors, and supply vendors for assigned projects. ",
        "Work within and develop the appropriate standards, specifications, and procedures, including but not limited to those required for production, technical, safety, and environmental activities. ",
        "Manage ordering of parts and supplies using Permac. ",
        "Define equipment engineered rates. ",
        "Review new process equipment and make recommendations for purchase/installation. ",
        "Manage the implementation of moderate sized capital projects. ",
        "Responsible for parts and supply development and reverse engineering. ",
        "Understands opportunities for OEE improvements and leads OEE improvement initiatives. ",
        "",
        "REQUIREMENTS",
        "",
        "Four-year college degree in an Engineering discipline preferred.  Two-year college degree and/or five or more years engineering support experience.",
        "Ability to organize and prioritize tasks and make appropriate decisions.",
        "Ability to perform assignments with moderate supervision.",
        "Ability to operate a computer workstation and the appropriate software/hardware.",
        "Ability to work in a production oriented environment.",
        "Ability to train and develop others.",
        "Ability to work under frequently changing priorities and deadlines.",
        "Verbal and written communication skills.",
        "Strong problem solving and project management skills."
      ],
      "aboutUs": "About Us\n\n\n\nCarpenter Technology Corporation (NYSE: CRS) is a recognized leader in high-performance specialty alloy-based materials and process solutions for critical applications in the aerospace, defense, transportation, energy, industrial, medical, and consumer electronics markets. Founded in 1889, Carpenter has evolved to become a pioneer in premium specialty alloys, including titanium, nickel, and cobalt, as well as alloys specifically engineered for additive manufacturing (AM) processes and soft magnetics applications. Carpenter recently expanded its AM capabilities to provide a complete “powder-to-part” solution to accelerate materials innovation, offer rapid prototyping, and streamline parts production.\n\nCarpenter Technology Corporation offers a competitive salary and a comprehensive benefits package including life, medical, dental, vision, flexible spending accounts, disability coverage, 401k with company contributions as well as many other options to employees. Learn more\n\nCarpenter Technology Corporation is committed to ensuring that its online application process provides an equal employment opportunity to all job seekers, including individuals with disabilities.  If you believe you need a reasonable accommodation in order to search for a job opening or to submit an application, please contact us by emailing employment@cartech.com.   We will work to assist disabled job seekers whose disability prevents them from being able to apply online.  Only messages sent for this purpose will be considered.  A response to your request may take up to 5 business days."
    }
  ],
  [
    {}
  ]
]